Diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <tabularSections>
    <name>ВКМ_Начисления</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ПроцентФиксПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/Forms/ФормаДокумента/Module.bsl
//{{ВКМ. Получение запросом из Регистра сведений "ВКМ_УсловияОплатыСотрудников" значений процента премии
&НаКлиенте
Процедура ВКМ_НачисленияВКМ_СотрудникПриИзменении(Элемент)
	ТекДанные = Элементы.ВКМ_Начисления.ТекущиеДанные;
	Сотрудник = ТекДанные.ВКМ_Сотрудник;
	ВидРасчета = ТекДанные.ВКМ_ВидРасчета;
	Результат = ВКМ_НачисленияВКМ_СотрудникПриИзмененииНаСервере(Сотрудник, ВидРасчета);
	ТекДанные.ВКМ_ПроцентПремии = Результат;
КонецПроцедуры   

&НаКлиенте
	Процедура ВКМ_НачисленияВКМ_ВидРасчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ВКМ_Начисления.ТекущиеДанные;
	Сотрудник = ТекДанные.ВКМ_Сотрудник;
	ВидРасчета = ТекДанные.ВКМ_ВидРасчета;
	Результат = ВКМ_НачисленияВКМ_СотрудникПриИзмененииНаСервере(Сотрудник, ВидРасчета);
	ТекДанные.ВКМ_ПроцентПремии = Результат;
	КонецПроцедуры

&НаСервере
Функция ВКМ_НачисленияВКМ_СотрудникПриИзмененииНаСервере(Сотрудник, ВидРасчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Подразделение КАК ВКМ_Подразделение,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад КАК ВКМ_Оклад,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентПремии КАК ВКМ_ПроцентПремии,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентФиксПремии КАК ВКМ_ПроцентФиксПремии
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник = &ВКМ_Сотрудник";
		
		Запрос.УстановитьПараметр("ВКМ_Сотрудник", Сотрудник);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();	 
		
		Если ВидРасчета <> Неопределено Тогда
			
			Если ВидРасчета.Наименование = "Премия за работы" Тогда
				ПроцентПремии = ВыборкаДетальныеЗаписи.ВКМ_ПроцентПремии;
			Иначе 
				ПроцентПремии = ВыборкаДетальныеЗаписи.ВКМ_ПроцентФиксПремии;
			КонецЕсли;
			
		Иначе   
			
			ПроцентПремии = 0;
			
		КонецЕсли;
		
		Возврат ПроцентПремии;
		
	КонецФункции
//}}ВКМ
